оперативныйучет2/src/DataProcessors/оуп_ЛинияРаспила/оуп_ЛинияРаспила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>оуп_ЛинияРаспила</name>
</mdclass:DataProcessor>

оперативныйучет2/src/AccumulationRegisters/оуп_ДанныеВыпускаПродукции/оуп_ДанныеВыпускаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>оуп_ДанныеВыпускаПродукции</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

оперативныйучет2/src/Catalogs/КонтрольнаяТочка/КонтрольнаяТочка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольнаяТочка</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>МастерТочки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТочки</name>
    <type>
      <types>EnumRef.ТипыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Весы</name>
    <type>
      <types>CatalogRef.ВесыКонтрольныхТочек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОстаткиМатериалов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВыпуска</name>
    <attributes>
      <name>Страница</name>
      <type>
        <types>CatalogRef.СтраницыФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполнятьКолонкуПланПоСпецификации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыПолучатели</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкладыОтправители</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

оперативныйучет2/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="902506bc-c31b-468b-8f65-73e4c9317c8a">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

оперативныйучет2/src/DataProcessors/оуп_ЛинияРаспила/Forms/ЗаполнениеПоСпецификации/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//TODO: Вставить содержимое обработчика
	Параметры.Свойство("ДатаСмены", Датасмены);
	Параметры.Свойство("Спецификация", Спецификация);
	КонтрольнаяТочка = ПараметрыСеанса.оуп_ТекущаяКонтрольнаяТочка;
	
	если 	не ЗначениеЗаполнено(ДатаСмены) или
			не ЗначениеЗаполнено(Спецификация) или
			не ЗначениеЗаполнено(КонтрольнаяТочка)	тогда
		Отказ = Истина;
		возврат;		
	КонецЕсли;
	
	Склад = КонтрольнаяТочка.Склад;
	
//	ЗаполнитьПараметрыСписков();
	ДобавитьКолонкиСкладов();
	ЗагрузитьДанныеВыпуска();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура ЗаполнитьПараметрыСписков()
//	МассивТаблиц = новый Массив;
//	МассивТаблиц.Добавить("Выпуск");
//	МассивТаблиц.Добавить("Материалы");
//	МассивТаблиц.Добавить("Произведено");
//	
//	для Каждого Таблица из МассивТаблиц Цикл
//		УстановитьПареметрыСписка(Таблица);
//	КонецЦикла;
//	
//КонецПроцедуры
//
//&НаСервере
//Процедура УстановитьПареметрыСписка(Имятаблицы)
//	ЭтотОбъект[Имятаблицы].Параметры.УстановитьЗначениеПараметра("Склад", Склад);
//	ЭтотОбъект[Имятаблицы].Параметры.УстановитьЗначениеПараметра("ДатаСмены", ДатаСмены);	
//КонецПроцедуры
//
////&НаСервере
//Функция ПолучитьТЗизДинамическогоСписка(ИмяТаблицы)
//
//	Схема = Элементы[ИмяТаблицы].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
//	Настройки = Элементы[ИмяТаблицы].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
//	
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
//	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
//	
//	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
//	
//	ТабЗначений = Новый ТаблицаЗначений;
//	
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
//	ПроцессорВывода.УстановитьОбъект(ТабЗначений);
//	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
//	
//	Возврат ТабЗначений;
//
//КонецФункции

&НаСервере
Процедура ДобавитьКолонкиСкладов()
	
	оуп_ФормированиеФорм.ДобавитьКолонкиСкладовТаблицы(
		ЭтотОбъект,
		КонтрольнаяТочка.Склад,
		КонтрольнаяТочка.СкладыПолучатели,
		"ВыходныеИзделия", 
		СоответствиеСкладов, 
		Элементы.ВыходныеИзделия
	);
	

КонецПроцедуры // ДобавитьКолонкиСкладов()

&НаСервере
Процедура ЗагрузитьДанныеВыпуска()
	запрос = новый запрос;
	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Склад
	|ПОМЕСТИТЬ втСклады
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрольнаяТочкаСкладыПолучатели.Склад
	|ИЗ
	|	Справочник.КонтрольнаяТочка.СкладыПолучатели КАК КонтрольнаяТочкаСкладыПолучатели
	|ГДЕ
	|	КонтрольнаяТочкаСкладыПолучатели.Ссылка = &КонтрольнаяТочка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	оуп_ДанныеВыпускаПродукцииОстатки.Спецификация,
	|	оуп_ДанныеВыпускаПродукцииОстатки.Номенклатура,
	|	оуп_ДанныеВыпускаПродукцииОстатки.КоличествоОстаток КАК Количество,
	|	оуп_ДанныеВыпускаПродукцииОстатки.СкладПолучатель КАК Склад
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	РегистрНакопления.оуп_ДанныеВыпускаПродукции.Остатки(, Склад = &Склад
	|	И Спецификация = &Спецификация
	|	И ДатаСмены = &ДатаСмены
	|	И СкладПолучатель В
	|		(ВЫБРАТЬ
	|			вт.склад
	|		ИЗ
	|			втСклады КАК вт)) КАК оуп_ДанныеВыпускаПродукцииОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	|ПОМЕСТИТЬ МассивТоваров
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	|ГДЕ
	|	РесурсныеСпецификацииВыходныеИзделия.Ссылка = &Спецификация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	втТовары.Номенклатура
	|ИЗ
	|	втТовары КАК втТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МассивТоваров.Номенклатура,
	|	ЕСТЬNULL(втТовары.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ЕСТЬNULL(втТовары.Количество, 0) КАК Количество
	|ИЗ
	|	МассивТоваров КАК МассивТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТовары КАК втТовары
	|		ПО МассивТоваров.Номенклатура = втТовары.Номенклатура";
	запрос.УстановитьПараметр("Склад", Склад);
	запрос.УстановитьПараметр("Спецификация", Спецификация);
	запрос.УстановитьПараметр("ДатаСмены", ДатаСмены);
	Запрос.УстановитьПараметр("КонтрольнаяТочка", КонтрольнаяТочка);
	
	
	РезультатЗапроса = запрос.Выполнить().Выгрузить();
	ИмяКолонкиКоличество = "Количество";
	СтрокаГруппировки = "Номенклатура";
	
	СтрокиТовары = РезультатЗапроса.Скопировать();
	СтрокиТовары.Свернуть(СтрокаГруппировки, ИмяКолонкиКоличество);
	ИмяКолонкиСклада = "Склад";

	
	для Каждого СтрокаТовар из СтрокиТовары Цикл 
		СтрокаВыходИзд = ВыходныеИзделия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаВыходИзд, СтрокаТовар, СтрокаГруппировки);
		ОтборСтроки = новый Структура(СтрокаГруппировки);
		ЗаполнитьЗначенияСвойств(ОтборСтроки, СтрокаТовар);
		СтрокаВыходИзд.количество =  СтрокаТовар.Количество;
		
		
		СтрокиПоСкладам = РезультатЗапроса.НайтиСтроки(ОтборСтроки);
		для Каждого СтрокаПоСкладу из СтрокиПоСкладам Цикл 
			если не ЗначениеЗаполнено(СтрокаПоСкладу[ИмяКолонкиСклада]) Тогда 
				// Пустые строки со складами пропускаем...
				Продолжить;
			КонецЕсли;
			
			ТекИмяКолонки = оуп_ФормированиеФорм.ИмяКолонкиСклада(СтрокаПоСкладу[ИмяКолонкиСклада], ЭтотОбъект);
			
			СтрокаВыходИзд[ТекИмяКолонки] = СтрокаПоСкладу[ИмяКолонкиКоличество];
						
		КонецЦикла;
 
		//ЗаполнитьИтогДляТекущегоСклада(СтрокаВыходИзд, ЭтотОбъект);

		
	КонецЦикла;
	

КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьИтогДляТекущегоСклада(СтрокаВыходныеИзделия, Форма)
//	ИмяКолонкиЭтогоСклада = оуп_ФормированиеФорм.ИмяКолонкиСклада(Склад ,Форма, Истина);
//	Объёмпередано = 0;
//	
//	для Каждого ИмяКолонкиПолучателя из КолонкиСкладовПолучателей(Форма) Цикл 
//		Объёмпередано = СтрокаВыходныеИзделия[ИмяКолонкиПолучателя] + Объёмпередано;
//	КонецЦикла;
//	
//	СтрокаВыходныеИзделия[ИмяКолонкиЭтогоСклада] = СтрокаВыходныеИзделия["Количество"] - Объёмпередано;
//КонецПроцедуры // ЗаполнитьИтогДляТекущегоСклада()

//&НаСервере
//Функция КолонкиСкладовПолучателей (Форма)
//	массивИменаКолонок = новый Массив;
//	
//	для Каждого Строка из Форма.КонтрольнаяТочка.СкладыПолучатели Цикл 
//		Отбор = Новый Структура("Склад", Строка.Склад);
//		//ЗаполнитьЗначенияСвойств(Отбор,Строка.КонтрольнаяТочка,"Склад");
//		СтрокиСоответствия = Форма.СоответствиеСкладов.НайтиСтроки(Отбор);
//		для Каждого СтрокаСоответствия из СтрокиСоответствия Цикл 
//			массивИменаКолонок.Добавить(СтрокаСоответствия.Имя);
//			Прервать;
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Возврат массивИменаКолонок;
//КонецФункции // КолонкиСкладовПолучателей()
#КонецОбласти
